# frozen_string_literal: true

#####################################
# 'brew tap'

tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'homebrew/cask-drivers'
tap 'heroku/brew'

#####################################
# 'brew install'

# libraries / utilities
brew 'ack' # Search tool like grep, but optimized for programmers
brew 'bash'
brew 'git'
brew 'git-extras' # Git utilities -- repo summary, repl, changelog population, author commit percentages and more
brew 'tree' # Display directories as trees (with optional color/HTML output)
brew 'wget'
brew 'bash-completion' # Programmable completion for Bash 3.2
# brew 'zsh-completions' # Additional completion definitions for zsh
brew 'hub'
brew 'coreutils' # GNU File, Shell, and Text utilities
# brew 'pkg-config' # Manage compile and link flags for libraries
# brew 'gpg' # GNU Privacy Guard
# brew 'gpg-agent' # GnuPG cryptographic agent
# brew 'gpg2' # GNU Privacy Guard
brew 'autoconf' # Automatic configure script builder
brew 'automake' # Tool for generating GNU Standards-compliant Makefiles
brew 'gnupg' # GNU Privacy Guard
brew 'gnupg2' # GNU Privacy Guard
brew 'openssl' # SSL/TLS cryptography library
brew 'jq'
brew 'mas'
# brew 'libtool' # Generic library support script
# brew 'heroku'
brew 'gh'
# brew 'go' # Open source programming language to build simple/reliable/efficient software

# data stores and tools
# brew 'mysql'
# brew 'mycli' # CLI for MySQL with auto-completion and syntax highlighting
brew 'postgresql', restart_service: :changed
# brew 'postgresql@14', restart_service: :changed
brew 'pgcli' # CLI for Postgres with auto-completion and syntax highlighting
# brew 'neo4j' # Robust (fully ACID) transactional property graph database
brew 'redis', restart_service: :changed
# brew 'mongodb' # High-performance, schema-free, document-oriented database
# brew 'memcached'
# brew 'rabbitmq'
# brew 'kafka'
# brew 'rabbitmq' # Most widely deployed open source message broker.
# brew 'activemq' # Apache ActiveMQ: powerful open source messaging server
# brew 'presto'
# brew 'apache-drill'
# brew 'influxdb'
# brew 'zookeeper' # Centralized server for distributed coordination of services
# brew 'yarn'
# brew 'kubernetes-cli' # Kubernetes command-line interface
# brew 'memcached' # High performance, distributed memory object caching system
# brew 'elasticsearch' # Distributed search & analytics engine

# media libraries and tools
# brew 'ghostscript' # Interpreter for PostScript and PDF
# brew 'imagemagick' # Tools and libraries to manipulate images in many formats
# brew 'fdk-aac'
# brew "ffmpeg", args: ["build-from-source", "with-fdk-aac", "with-ffplay", "with-freetype", "with-libass", "with-libquvi", "with-libvorbis", "with-libvpx", "with-opus", "with-x265", "with-openh264"]
# brew "ffmpeg"
# brew 'media-info'
# brew 'youtube-dl'
# brew 'vips'
brew 'plantuml' # Draw UML diagrams

# aws tools
# brew 'terraform' # Tool to build, change, and version infrastructure
# brew 'awscli'
# brew 'chamber'
# brew 'tfenv'
# brew 's3cmd'
# brew 'awslogs'
# brew 'cli53'
# brew 'aws-elasticbeanstalk'
# brew 'aws-sam-cli'
# brew 'aws-shell'
# brew 'aws-okta'
# brew 'aws-vault'
# brew 'aws-iam-authenticator'
# brew 'aws-sso-util'
# brew 'amazon-ecs-cli' # CLI for Amazon ECS to manage clusters and tasks for development.

#####################################
# 'brew install --cask'

# set arguments for all 'brew install --cask' commands
cask_args appdir: '~/Applications', require_sha: true

cask 'chromedriver' # Automated testing of webapps for Google Chrome

cask 'private-internet-access'
cask 'google-chrome'
cask 'visual-studio-code'
cask 'jetbrains-toolbox'
cask 'mailspring'
# cask 'bbedit'
# cask 'atom'
# cask 'transmit'
cask 'slack'
# cask 'docker'
# cask 'firefox'
# cask 'vlc'
# cask 'duet'
cask 'postman'
cask 'telegram'
cask 'elgato-stream-deck'
cask 'bartender'
cask 'gimp'
cask 'sourcetree'
cask 'istat-menus'
cask 'thinkorswim'
cask 'spotify'
cask 'google-drive'
cask 'copyclip'
cask 'sourcetree'

# Quicklook
cask 'qlcolorcode'
cask 'avifquicklook' # QuickLook Plugin for AVIF images
# cask 'qlmarkdown'
# cask 'quicklook-json'
# cask 'quicklook-csv'
# cask 'qlstephen'
# cask 'qlvideo'

#####################################
# 'mas install'

mas 'Window Tidy', id: 456609775
